The only change during upgrade is the group block and results in an `update in-place`.

This is expected and the exact details vary by the existing deployment.
- existing deployment with less then 4G memory: The group memory block will update in-place to 4G of memory.
- existing deployment with 4G plus memory: No change.
- existing deployment adding host_flavor (as below): The group memory block will update in-place to the flavor chosen.

The upgrade test is safe to skip

```hcl
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: Terraform used the selected providers to generate the following execution
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: plan. Resource actions are indicated with the following symbols:
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:   ~ update in-place
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:  <= read (data resources)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: Terraform will perform the following actions:
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:   # module.enterprise_db.data.ibm_database_connection.database_connection will be read during apply
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:   # (depends on a resource or a module with changes pending)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:  <= data "ibm_database_connection" "database_connection" {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + amqps         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + analytics     = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + bi_connector  = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + cli           = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + deployment_id = "crn:v1:bluemix:public:databases-for-enterprisedb:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bb4573b4-e22f-4490-9b9d-0ac9908f4461::"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + emp           = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + endpoint_type = "private"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + grpc          = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + https         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + id            = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + mongodb       = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + mqtts         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + mysql         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + ops_manager   = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + postgres      = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + rediss        = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + secure        = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + stomp_ssl     = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + user_id       = "admin"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + user_type     = "database"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:     }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:   # module.enterprise_db.ibm_database.enterprise_db will be updated in-place
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:   ~ resource "ibm_database" "enterprise_db" {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:         id                        = "crn:v1:bluemix:public:databases-for-enterprisedb:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bb4573b4-e22f-4490-9b9d-0ac9908f4461::"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:         name                      = "edb-upg-hr6lgg-edb"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:         tags                      = []
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:         # (21 unchanged attributes hidden)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       - group {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           - group_id = "member" -> null
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           - cpu {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:               - allocation_count = 3 -> null
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           - disk {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:               - allocation_mb = 20480 -> null
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           - members {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:               - allocation_count = 3 -> null
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           - memory {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:               - allocation_mb = 1024 -> null
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:         }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:       + group {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           + group_id = "member"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           + disk {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:               + allocation_mb = 20480
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           + host_flavor {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:               + id = "b3c.4x16.encrypted"
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:           + members {
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:               + allocation_count = 3
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:         }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:         # (3 unchanged blocks hidden)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:     }
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: Plan: 0 to add, 1 to change, 0 to destroy.
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: Changes to Outputs:
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:   ~ hostname                   = "bb4573b4-e22f-4490-9b9d-0ac9908f4461.c3jgsjqf0prn36465j00.private.databases.appdomain.cloud" -> (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185:   ~ port                       = 30136 -> (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: ─────────────────────────────────────────────────────────────────────────────
TestRunUpgradeCompleteExample 2024-06-27T09:52:42Z command.go:185: 
```